data_generation/simulation_results/case_21/constant/simParams
nIter 2000;
hComponent0 2661.137745692366;
hComponent1 3916.548335505384;
hComponent2 609.8450980759735;
hComponent3 3014.3344481098;
hComponent4 1083.6286819937786;kComponent0 97.84113331877603;
kComponent1 35.94703289246048;
kComponent2 10.668266623559502;
kComponent3 62.57223241425773;
kComponent4 77.34033449053453;
tAmbient 300;
Ux 0.6539486604666573;
kPCB 0.992832051755459;