data_generation/simulation_results/case_21/system/fvConstraints
limitTair
{
    type limitTemperature;
    selectionMode all;
    min 310;
    max 500;
    phase air;
}
